[{
  "_id": {
    "$oid": "679c80535eb089242184fe30"
  },
  "season": "Winter",
  "name": "Samba Dashami",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Samba_dashami.jpg/1200px-Samba_dashami.jpg",
  "bio": "Samba Dashami is a unique festival celebrated in Odisha, dedicated to the worship of the Sun God (Surya). Observed on the tenth day (Dashami) of the Shukla Paksha in the Hindu month of Pausha (December–January), it holds deep mythological and cultural significance.\r\n\r\nAccording to legend, Samba, the son of Lord Krishna, was cursed with leprosy. As per the Brahma Purana, he performed penance for 12 years at Konark, Odisha, worshipping Surya. Pleased with his devotion, the Sun God cured him. In gratitude, Samba initiated Surya worship, which evolved into the festival of Samba Dashami.\r\n\r\nThe celebrations begin before dawn, with mothers preparing a special offering (Samba Dashami Bhog) that includes Khichdi, vegetables, fruits, coconut, and sweets, presented to Surya at sunrise. Women take ritual baths and offer water (Arghya) to the Sun, praying for their children's well-being. Traditional pancakes (pithas) like Manda Pitha and Arisa Pitha are also prepared. Families gather to hear stories of Samba and Surya, preserving cultural heritage. The day ends with evening prayers and offerings.\r\n\r\nSamba Dashami highlights Odisha’s deep-rooted Sun worship, reflected in the iconic Konark Sun Temple. The festival emphasizes Surya’s significance in health, agriculture, and spirituality, reinforcing cultural and social values.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679c822f5eb089242184fe33"
  },
  "season": "Winter",
  "name": "Makar Sankranti",
  "image": "https://t3.ftcdn.net/jpg/05/77/44/28/360_F_577442831_XnXJvDNU6Lv2kRemBGW2ilfu8zkWGJO4.jpg",
  "bio": "Makar Sankranti: The Festival of Harvest and Transition\r\n\r\nMakar Sankranti is a major Hindu festival celebrated across India, marking the Sun’s transition into Capricorn (Makara). Falling on January 14th each year, it signifies the end of winter and the beginning of longer, warmer days. Unlike most Hindu festivals based on the lunar calendar, Makar Sankranti follows the solar calendar, making it a fixed-date festival. It marks the Sun’s northward movement (Uttarayan), symbolizing growth, prosperity, and positivity.\r\n\r\nThe festival is primarily a harvest celebration, expressing gratitude for nature’s bounty. It also holds spiritual importance, as devotees take holy dips in rivers like the Ganga, Yamuna, and Godavari, believed to cleanse sins.\r\n\r\nMakar Sankranti is observed differently across India. In Tamil Nadu, it is celebrated as Pongal, a four-day festival with special dishes made of rice and jaggery. Lohri in Punjab and Haryana features bonfires, folk songs, and dances. Uttarayan in Gujarat and Rajasthan is known for vibrant kite-flying. Magh Bihu in Assam involves feasting and traditional games. In West Bengal, Poush Sankranti is marked by special rice cakes, while Khichdi Parv in Uttar Pradesh and Bihar includes charity and communal feasting.\r\n\r\nCommon rituals include taking holy dips, offering prayers to the Sun, preparing sweets with sesame and jaggery, and donating to the needy, reinforcing warmth, unity, and generosity.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679c847d5eb089242184fe36"
  },
  "season": "Winter",
  "name": "Kartik Purnima",
  "image": "https://financesaathi.com/adm/uploads/_7515_22.jpg",
  "bio": "Kartik Purnima: A Sacred Hindu Festival\r\n\r\nKartik Purnima, celebrated on the full moon day of the Kartik month (October–November), is one of the most auspicious festivals in Hinduism, Jainism, and Sikhism. It is associated with religious rituals, charity, and cultural festivities.\r\n\r\nIn Hindu beliefs, Lord Vishnu is said to have taken his Matsya Avatar on this day to save the Vedas from demon Hayagriva. It is also linked to Tulsi Vivah, marking the sacred wedding of Tulsi and Lord Vishnu. Devotees worship Lord Shiva by visiting temples and offering prayers. For Jains, Kartik Purnima is significant as Lord Mahavira’s first disciples (Ganadharas) were initiated on this day, making it a day of fasting and temple visits. In Sikhism, Guru Nanak Jayanti, the birth anniversary of Guru Nanak Dev Ji, often coincides with this festival and is celebrated with prayers, kirtans, and community service.\r\n\r\nKey rituals include Kartik Snan (holy dips in rivers like the Ganges and Yamuna), Deep Daan (lighting earthen lamps), and participation in fairs like the Pushkar Fair in Rajasthan and Boita Bandana in Odisha. People also engage in charity, donating food and clothes.\r\n\r\nKartik Purnima promotes dharma, devotion, and good deeds, inspiring people toward a righteous life.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679c86c15eb089242184fe39"
  },
  "season": "Winter",
  "name": "Manabasa Gurubara",
  "image": "https://thesrinibash.wordpress.com/wp-content/uploads/2019/11/img_20191121_193502.jpg?w=1568",
  "bio": "Manabasa Gurubara: A Festival of Goddess Lakshmi in Odisha\r\n\r\nManabasa Gurubara is a traditional Odia festival dedicated to Goddess Lakshmi, observed on Thursdays of Margashirsha (November–December). It symbolizes devotion, purity, and the role of women in household prosperity.\r\n\r\nThe festival is linked to the Laxmi Purana, written by saint Balarama Das, narrating the story of Sriya Chandaluni, a lower-caste woman whose devotion pleased Lakshmi. When Lord Jagannath and Balabhadra disapproved of her worship, Lakshmi left Jagannath’s temple, bringing distress. Realizing their mistake, the deities welcomed her back, promoting social equality and justice.\r\n\r\nRituals begin with house cleaning and decorating Jhoti or Muruja (rice flour rangoli) depicting Lakshmi’s footprints. The name “Manabasa” comes from \"Mana\", a measuring unit for paddy, which is offered to Lakshmi as a symbol of abundance. Women recite Laxmi Purana, prepare offerings like Kheeri (rice pudding) and Pitha (pancakes), and observe fasts for family prosperity.\r\n\r\nBeyond religious devotion, Manabasa Gurubara conveys social harmony, teaching that wealth should be shared among all. Celebrated during the harvest season, it also expresses gratitude for nature’s bounty, reinforcing spiritual and cultural values.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679c876f5eb089242184fe3c"
  },
  "season": "Winter",
  "name": "Prathamastami",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Enduri_Pitha.JPG/640px-Enduri_Pitha.JPG",
  "bio": "Prathamastami: A Celebration of the Firstborn in Odisha\r\n\r\nPrathamastami is a traditional Odia festival dedicated to honoring the eldest child in a family. Celebrated on the eighth day (Ashtami) of Krishna Paksha in Margashirsha (November–December), it symbolizes blessings, responsibility, and familial love.\r\n\r\nThe festival is rooted in the belief that the firstborn carries the family’s legacy and responsibilities. Parents seek blessings from Lord Lingaraj and Goddess Shashti, the protector of children, for their well-being and success.\r\n\r\nRituals include an early morning bath, wearing new clothes, and receiving blessings from elders. Families perform a puja for Goddess Shashti, praying for the child’s health and prosperity. The highlight of Prathamastami is the preparation of Enduri Pitha, a steamed rice dumpling filled with coconut and jaggery, wrapped in turmeric leaves. Other delicacies like Dalma and Chhena Poda are also offered and enjoyed. Parents and elders express their affection by giving gifts to the eldest child.\r\n\r\nBeyond family bonds, Prathamastami is linked to agricultural traditions, marking the transition to winter and the use of freshly harvested crops. The festival beautifully blends cultural heritage, devotion, and gratitude, reinforcing the importance of family values.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679c886d5eb089242184fe3f"
  },
  "season": "Winter",
  "name": "Kurala Panchami",
  "image": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Kurala_Panchami.jpg",
  "bio": "Kurala Panchami: A Unique Festival of Odisha\r\n\r\nKurala Panchami is a traditional festival of Odisha dedicated to Lord Surya (Sun God), celebrated on the fifth day (Panchami) of Shukla Paksha in Pausha (December–January). Primarily observed by women, the festival is a prayer for the health, prosperity, and longevity of their children and family.\r\n\r\nThe Sun God is revered as the source of life and energy, and legends suggest that observing Kurala Panchami with devotion can cure diseases and bring prosperity.\r\n\r\nThe festival begins with pre-dawn rituals, where women take a holy bath and prepare for Surya Puja. Devotees offer Arghya (water) to the rising Sun, chanting prayers. A special Kurala Panchami Bhog, including pithas (pancakes), fruits, and sweets, is prepared and offered. Many women observe a fast (vrata) for family well-being. A significant part of the festival is the storytelling tradition, where elders narrate mythological tales about Lord Surya, preserving cultural heritage.\r\n\r\nKurala Panchami reflects Odisha’s deep-rooted Surya worship, seen in the Konark Sun Temple. The festival highlights the Sun’s role as a life-giver and protector, reinforcing spiritual, familial, and cultural values.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679c8a075eb089242184fe43"
  },
  "season": "Winter",
  "name": "Dhanu Sankranti",
  "image": "https://www.holidayscalendar.com/wp-content/uploads/2022/06/Dhanu-Sankranti.jpg",
  "bio": "Dhanu Sankranti: A Sacred Harvest Festival in Odisha\r\n\r\nDhanu Sankranti is a significant Hindu festival celebrated in Odisha, marking the Sun’s transition into Dhanu Rashi (Sagittarius). Observed in December, it symbolizes the harvest season and the beginning of auspicious rituals.\r\n\r\nThe festival is dedicated to Lord Surya (Sun God) and Lord Jagannath. It is believed that this period is sacred for prayers, charity, and prosperity.\r\n\r\nDevotees perform Surya Puja, offering Arghya (water), fruits, and sweets to the Sun God for health and abundance. At the Jagannath Temple in Puri, special rituals are conducted, and Dhanu Muan Bhog (a sweet made of jaggery and rice) is offered to Lord Jagannath.\r\n\r\nA highlight of Dhanu Sankranti is the Dhanu Yatra, a grand open-air theatrical festival in Bargarh, Odisha. The entire town transforms into Mathura, reenacting Lord Krishna’s childhood stories, especially his visit to King Kansa’s Dhanu Yatra.\r\n\r\nFollowing Hindu traditions, devotees offer food and clothes to the needy. Special dishes like Pakhala (fermented rice), Khiri, and Muan are prepared.\r\n\r\nBeyond its religious significance, Dhanu Sankranti marks agricultural prosperity, with farmers praying for a bountiful harvest, reinforcing spiritual and cultural unity.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679c90ed5eb089242184fe46"
  },
  "season": "Winter",
  "name": "Jagara",
  "image": "https://cdn1.img.sputniknews.in/img/07e7/02/13/928103_0:154:1280:875_1920x0_80_0_0_c3b3bd4257e6ced9c90a99c3d346fddd.jpg",
  "bio": "Jagara: A Night of Vigil and Devotion\r\n\r\nJagara, also known as Jagara Puja or Maha Shivaratri, is a Hindu festival dedicated to Lord Shiva, primarily celebrated in Odisha. Observed on the 14th night of Krishna Paksha in Phalguna (February–March), Jagara means “to stay awake,” symbolizing night-long devotion.\r\n\r\nThe festival is linked to Hindu legends:\r\n\r\nSamudra Manthan – Lord Shiva drank the deadly Halahala poison to save creation, and devotees kept vigil in his honor.\r\nShiva-Parvati’s Divine Wedding – The festival celebrates their celestial union, symbolizing balance.\r\nSalvation of a Hunter – A hunter unknowingly worshipped Shiva while staying awake and attained moksha (liberation).\r\nRituals and Celebrations:\r\n\r\nFasting – Devotees observe austere fasts, consuming fruits, milk, or water.\r\nNight Vigil (Jagara) – Temples remain illuminated with bhajans and chants of Om Namah Shivaya.\r\nShiva Linga Abhisheka – The deity is bathed with milk, honey, and bel leaves.\r\nTemple Visits – Grand celebrations occur at Lingaraj Temple in Bhubaneswar.\r\nCultural Events – Folk dances and spiritual storytelling enhance the festivities.\r\nJagara symbolizes devotion, wisdom, and the triumph of good over evil, reflecting Odisha’s deep spiritual and cultural heritage.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679c92215eb089242184fe49"
  },
  "season": "Spring",
  "name": "Dol Purnima",
  "image": "https://victoriaclubhotel.com/Images/blog/dola_yatra1.jpg",
  "bio": "Dol Purnima: The Festival of Colors and Devotion\r\n\r\nDol Purnima, also known as Dol Jatra, is a vibrant festival celebrated in Odisha, West Bengal, Assam, and Bangladesh. It falls on the full moon (Purnima) of Phalguna (February–March) and is dedicated to Lord Krishna. It coincides with Holi but has unique devotional aspects.\r\n\r\nMythological Significance\r\nDol Purnima is associated with Krishna and Radha. According to Hindu mythology, Krishna celebrated colors with Radha and the Gopis, symbolizing divine love and joy. It also marks the birth anniversary of Chaitanya Mahaprabhu, a saint who promoted the Bhakti movement.\r\n\r\nRituals and Celebrations\r\nSwinging the Deities – Idols of Radha and Krishna are placed on a decorated swing (Dol), and devotees sing devotional songs.\r\nProcessions and Kirtans – Colorful processions with bhajans, drums, and traditional dances fill the streets.\r\nPlaying with Colors – People apply Abir (colored powder) to each other, celebrating joy and unity.\r\nSpecial Offerings – Devotees prepare sweets like Malpua, Khira, and Pitha for Krishna.\r\nFasting and Charity – Many observe fasts and donate food and clothes.\r\nCultural Importance\r\nDol Purnima strengthens community bonds through music, dance, and festivities. In Bengal, it marks the last full moon of the Bengali year, while in Odisha, it is part of Jagannath culture.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679ddb4cc05aa573c2f54d7b"
  },
  "season": "Summer",
  "name": "Pana Sankranti",
  "image": "https://img-global.cpcdn.com/recipes/18c97b8b6c2c87e0/680x482cq70/pana-recipe-main-photo.jpg",
  "bio": "Pana Sankranti: Odisha’s Traditional New Year Festival\r\n\r\nPana Sankranti, also known as Maha Vishuba Sankranti, marks the Odia New Year and is celebrated across Odisha on April 14th. It signifies the Sun’s transition into Mesha Rashi (Aries), symbolizing renewal, prosperity, and gratitude. This festival is dedicated to Lord Jagannath, Lord Shiva, and Goddess Shakti.\r\n\r\nSignificance and Rituals\r\nPana Sankranti follows the traditional solar calendar, marking the beginning of a new cycle. It also signifies summer’s arrival, highlighting water conservation’s importance.\r\n\r\nDrinking ‘Pana’ (Sweetened Drink) – The festival is named after Pana, a cooling drink made of jaggery, water, yogurt, coconut, and fruits. It is offered to deities and shared as Prasad. An earthen pot with a small hole is hung, allowing water to drip onto a Tulsi plant, symbolizing life-giving energy.\r\nWorship of Deities – Devotees visit Jagannath, Shiva, and Shakti temples and participate in special pujas and Yagnas.\r\nDanda Nata & Jhamu Yatra – In southern Odisha, the ritualistic Danda Nata dance concludes on this day, while devotees perform Jhamu Yatra, walking barefoot over burning charcoal to honor Lord Shiva.\r\nCharity and Feasting – People engage in donations, feeding the poor, and preparing traditional Odia dishes like Pakhala Bhata, Chhena Poda, and Dalma.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679ddd6bc05aa573c2f54d80"
  },
  "season": "Summer",
  "name": "Savitri Vrata",
  "image": "https://www.odishalifestyle.com/wp-content/uploads/2023/09/Sabitri-brata.jpg",
  "bio": "Savitri Vrata: A Sacred Fast for Marital Bliss\r\n\r\nSavitri Vrata, also known as Savitri Amavasya or Savitri Brata, is a Hindu festival observed by married women, mainly in Odisha, Bihar, Uttar Pradesh, and West Bengal. Celebrated on Jyestha Amavasya (new moon day of Jyestha, May–June), it is dedicated to Devi Savitri, symbolizing devotion and marital fidelity.\r\n\r\nMythological Significance\r\nThe festival is inspired by the Mahabharata story of Savitri and Satyavan. Savitri’s unwavering devotion and wisdom helped her defy fate and bring back her husband Satyavan from Yama, the god of death. This tale represents women’s strength and dedication.\r\n\r\nRituals and Traditions\r\nFasting and Attire – Women wake up early, bathe, wear red or yellow sarees, and observe a Nirjala Vrata (fast without water) for their husbands' long life.\r\nWorship of Savitri and Banyan Tree – Idols or images of Savitri, Satyavan, and Yama are worshiped along with banyan tree leaves, symbolizing longevity.\r\nReciting the Savitri Katha – The Savitri-Satyavan story is read, reinforcing devotion and perseverance.\r\nOffering Bhog – Special offerings like soaked chana, mangoes, pithas, and sweets are made.\r\nBreaking the Fast – Women conclude the vrata by consuming the prasad and seeking their husbands' blessings.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679dde66c05aa573c2f54d83"
  },
  "season": "Summer",
  "name": "Raja",
  "image": "https://i0.wp.com/santwonapatnaik.com/wp-content/uploads/2020/06/raja_feature-scaled.jpg?fit=2560%2C1706&ssl=1",
  "bio": "Raja Festival: Celebrating Womanhood and Mother Earth\r\n\r\nRaja Parba (pronounced \"Raw-Jaw\") is a unique festival of Odisha, dedicated to womanhood, fertility, and Mother Earth’s renewal. Celebrated in mid-June (Jyestha month), it marks the onset of monsoon and symbolizes Bhudevi’s (Mother Earth’s) menstruation period. The fourth day, Vasumati Snana, signifies her purification.\r\n\r\nSignificance of Raja\r\nRaja is linked to agriculture and fertility, as Mother Earth is given time to rejuvenate, just like women during their menstrual cycle. It also celebrates girlhood, giving young girls and women a break from daily chores.\r\n\r\nThree Days of Celebration\r\nPahili Raja (First Day) – Homes are cleaned and decorated with Jhoti-Chita (rangoli). Women enjoy a restful day, avoiding household work.\r\nRaja Sankranti (Second Day) – The most important day, marking the Sun’s transition into Mithuna Rashi (Gemini). Women wear new clothes, Alata (red dye) on feet, and enjoy festivities.\r\nBasi Raja (Third Day) – A continuation of joy, games, and feasting.\r\nVasumati Snana (Fourth Day) – Mother Earth is bathed with turmeric water, marking purification.\r\nFestive Traditions\r\nSwings & Songs – Girls sing Raja Geeta while swinging.\r\nGames – Outdoor games like Kabaddi, Puchi, and Ludo bring communities together.\r\nFood – Delicacies like Poda Pitha, Manda Pitha, and Kakara Pitha are enjoyed.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679ddf5ec05aa573c2f54d86"
  },
  "season": "Summer",
  "name": "Rath Yatra",
  "image": "https://www.thepolicychronicle.co.in/wp-content/uploads/2021/05/ratha.jpg",
  "bio": "Rath Yatra: The Grand Chariot Festival of Lord Jagannath\r\n\r\nRath Yatra, or the Chariot Festival, is one of the most significant Hindu festivals, celebrated with grandeur in Puri, Odisha. Dedicated to Lord Jagannath, Balabhadra, and Subhadra, it takes place on the Dwitiya Tithi (second day) of Shukla Paksha in Ashadha (June–July).\r\n\r\nMythological Significance\r\nAccording to legends, Lord Jagannath desires to visit Gundicha Temple, his aunt’s home. This journey represents divine love and unity, as the deities leave their main abode, Jagannath Temple, to bless devotees.\r\n\r\nMajor Rituals & Celebrations\r\nChariot Construction – Three grand wooden chariots are made annually:\r\nNandighosha (Jagannath) – 45 ft, 16 wheels.\r\nTaladhwaja (Balabhadra) – 44 ft, 14 wheels.\r\nDarpadalana (Subhadra) – 43 ft, 12 wheels.\r\nPahandi Procession – Deities are brought out with chants, music, and dance.\r\nChhera Pahanra – The King of Puri sweeps the chariots, symbolizing humility.\r\nPulling the Chariots – Devotees pull them from Jagannath Temple to Gundicha Temple (3 km).\r\nStay & Bahuda Yatra – The deities stay for nine days before returning.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679de0edc05aa573c2f54d89"
  },
  "season": "Monsoon",
  "name": "Khudurukuni",
  "image": "https://www.odishalifestyle.com/wp-content/uploads/2023/11/Khudurkuni-Osha-Odishas-Celebration-of-Brothers-and-Sisters.jpg",
  "bio": "Khudurukuni Osha: A Festival of Devotion and Sisterhood in Odisha\r\n\r\nKhudurukuni Osha is a beloved festival in Odisha, observed by young unmarried girls in devotion to Goddess Mangala. Celebrated on Sundays in Bhadraba (August–September), it is dedicated to praying for the well-being of brothers and a prosperous future.\r\n\r\nMythological Significance\r\nThe festival is linked to Tapoi, a young girl from a merchant family. After losing her parents, she was mistreated by her brothers' wives while they were away on business. Seeking solace, she worshipped Goddess Mangala, who ultimately protected and avenged her. The story symbolizes sisterly devotion and faith in divine justice.\r\n\r\nRituals and Celebrations\r\nEarly Morning Worship – Girls wake up early, bathe, and collect flowers for puja.\r\nSacred Offering (Prasad) – Chuda (flattened rice), coconut, jaggery, bananas, and sweets are offered.\r\nMangal Arati – Devotees sing bhajans and prayers dedicated to Goddess Mangala.\r\nReading of Tapoi Katha – The legend of Tapoi is recited, reinforcing values of love and faith.\r\nFloating Diyas Ritual – In the evening, girls light oil lamps (diyas) and float them on water bodies, symbolizing prayers reaching the Goddess.\r\n            \r\n            \r\n            \r\n            ",
  "__v": 0
},
{
  "_id": {
    "$oid": "679de1edc05aa573c2f54d8c"
  },
  "season": "Autumn",
  "name": "Vishwakarma Puja",
  "image": "https://phool.co/cdn/shop/articles/1726260709479how-to-do-vishwakarma-puja-at-home-a-step-by-step-guide.jpg?v=1726663083",
  "bio": "Vishwakarma Puja: Worship of the Divine Architect\r\n\r\nVishwakarma Puja is a Hindu festival dedicated to Lord Vishwakarma, the divine architect and engineer of the gods. Celebrated by artisans, craftsmen, engineers, and industrial workers, it is observed to seek blessings for success, safety, and prosperity in their professions.\r\n\r\nDate and Significance\r\nVishwakarma Puja is observed on Kanya Sankranti (September 17), marking the Sun’s transition into Virgo (Kanya Rashi). It is widely celebrated in factories, workshops, offices, and industrial sectors.\r\n\r\nMythological Background\r\nLord Vishwakarma is revered as the architect of the universe, credited with designing:\r\n\r\nSwarga – The heavenly abode of the gods.\r\nDwarka – The splendid city of Lord Krishna.\r\nPushpaka Vimana – The flying chariot of Ravana.\r\nHastinapur & Indraprastha – The legendary cities of the Mahabharata.\r\nGolden Lanka – The grand kingdom of Ravana.\r\nRituals and Celebrations\r\nWorship of Tools and Machinery – Workplaces, tools, and machines are cleaned and decorated. No work is done as a mark of respect.\r\nVishwakarma Puja Rituals – A priest conducts Havan (fire sacrifice) and Aarti, with offerings of flowers, sweets, and coconut.\r\nPrasad Distribution – Devotees prepare and share offerings like modaks, laddoos, and khichdi.\r\nKite Flying – In states like Bihar, Jharkhand, and West Bengal, flying kites adds joy to the festivities.\r\nCommunity Feasts – Workplaces organize feasts, fostering teamwork and harmony.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679de27dc05aa573c2f54d8f"
  },
  "season": "Autumn",
  "name": "Mahalaya",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgRjTbCKFguxsMCNpDTHFc0QUHuVU6Abz4KENOYcDIV2YnCaksoWVze6fud0CY6oImGAJ6x1qky7V4XmGdbf2f7jKUiQQnmWHlGUAkCa2sb9UkNdXOdVMNz54FP3_IsosLLVzk6BRTIkPx7BRtRzFPFToFMHsNbP52DN3vj6_8idxlhlcH1v8z0HqVO/s1401/mahalaya%202022.jpg",
  "bio": "Mahalaya: The Beginning of Devi Paksha\r\n\r\nMahalaya marks the beginning of Devi Paksha and the end of Pitru Paksha, observed on Amavasya (new moon day) of Ashwin month (September–October). It is an important day in West Bengal, Odisha, Assam, and other eastern regions, signaling the arrival of Goddess Durga and the start of Durga Puja preparations.\r\n\r\nMythological Significance\r\nAccording to Hindu mythology, Mahalaya is the day when the gods created Goddess Durga by combining their divine energies to defeat the demon Mahishasura, restoring balance in the universe. It is also the culmination of Pitru Paksha, a 16-day period dedicated to honoring ancestors.\r\n\r\nRituals and Celebrations\r\nTarpan for Ancestors – Devotees perform Tarpan on riverbanks, offering water, sesame seeds, and food for the peace of departed souls.\r\nChanting of Mahishasura Mardini – The iconic Mahishasura Mardini recital by Birendra Krishna Bhadra on All India Radio at dawn is a revered tradition in Bengal.\r\nChokkhu Daan (Eye Painting Ritual) – Idol makers in Kolkata perform Chokkhu Daan, painting the eyes of Goddess Durga, symbolizing her arrival.\r\nInvitation to Goddess Durga – Devotees welcome Durga Maa to Earth, marking the spiritual beginning of Durga Puja.",
  "__v": 0
},
{
  "_id": {
    "$oid": "679de3acc05aa573c2f54d94"
  },
  "season": "Autumn",
  "name": "Kumara Purnima",
  "image": "https://www.odishabytes.com/wp-content/uploads/2017/10/kumar-purnima-1.jpg",
  "bio": " Kumara Purnima: The Festival of Youth and Prosperity in Odisha  \r\n\r\nKumara Purnima is a significant festival celebrated in Odisha, primarily by unmarried girls who seek blessings for a handsome and ideal husband like Lord Kartikeya (Kumara). It falls on the full moon day (Purnima) of the Ashwina month (September–October) and coincides with the Sharad Purnima festival observed in other parts of India.  \r\n\r\n Mythological Significance  \r\nThe festival is dedicated to Lord Kartikeya, the son of Lord Shiva and Goddess Parvati, who is considered the most handsome and brave deity. It is believed that unmarried girls who observe this festival with devotion will be blessed with a suitable husband. The full moon night is also considered auspicious, as it marks the divine Raasa Lila of Lord Krishna with the Gopis of Vrindavan.  \r\n\r\n Rituals and Celebrations  \r\n1. Early Morning Rituals – Girls wake up before sunrise, take a holy bath, and wear new clothes, usually in traditional attire.  \r\n2. Worship of the Moon and Lord Kartikeya – Prayers and offerings of fruits, flowers, and sweets are made to Lord Kartikeya and the Moon God (Chandra Deva) for beauty, prosperity, and marital bliss.  \r\n3. Sasthi Osha and Gajalaxmi Puja – In some regions, Sasthi Devi, the Goddess of fertility, is also worshipped. Gajalaxmi Puja, dedicated to Goddess Laxmi, is performed in the evening, seeking blessings for wealth and happiness.  \r\n4. 'Chanda Chakata' Offering – A special food offering made of puffed rice, banana, sugar, coconut, and milk is prepared and placed before the Moon as an offering.  \r\n        \r\n            ",
  "__v": 0
}]